Revit 2027 API
ExternalEvent.CreateJournalable Method
 Creates an instance of external event which will have the ability to record its executions in the journal.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalEvent CreateJournalable(
	IExternalEventHandler handler
)
Public Shared Function CreateJournalable (
	handler As IExternalEventHandler
) As ExternalEvent
public:
static ExternalEvent^ CreateJournalable(
	IExternalEventHandler^ handler
)
static member CreateJournalable :
        handler : IExternalEventHandler -> ExternalEvent
Parameters
handler IExternalEventHandler
 An instance of IExternalEventHandler which will execute the event.
Return Value
ExternalEvent
 An instance of ExternalEvent class, which will be used to invoke the event
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
ExternalEvent Class
Autodesk.Revit.UI Namespace